meteo_services/src/test/java/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:mt="http://127.0.0.1/ws">
   <soapenv:Header/>
   <soapenv:Body>
      <mt:getMeteoReportRequest>
         <mt:name>London</mt:name>
      </mt:getMeteoReportRequest>
   </soapenv:Body>
</soapenv:Envelope>
